{"class_name": "Sequential", "keras_version": "2.1.2", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null, "name": "lstm_1", "go_backwards": false, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "units": 32, "return_state": false, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dtype": "float32", "return_sequences": true, "bias_constraint": null, "batch_input_shape": [null, 3, 2], "unit_forget_bias": true, "activation": "tanh", "recurrent_constraint": null, "dropout": 0.0, "implementation": 1, "stateful": false}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null, "name": "lstm_2", "go_backwards": false, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "units": 32, "return_state": false, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "return_sequences": false, "bias_constraint": null, "recurrent_constraint": null, "activation": "tanh", "dropout": 0.0, "implementation": 1, "stateful": false}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "units": 128}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "units": 1}}], "backend": "tensorflow"}