{"backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"units": 256, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "batch_input_shape": [null, 8], "trainable": true, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 256, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_constraint": {"class_name": "NonNeg", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_3", "trainable": true, "kernel_regularizer": null}}]}