{"backend": "tensorflow", "keras_version": "2.1.2", "config": [{"config": {"return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "implementation": 1, "unroll": false, "recurrent_constraint": null, "kernel_constraint": null, "return_state": false, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "kernel_regularizer": null, "activation": "tanh", "dropout": 0.0, "use_bias": true, "dtype": "float32", "stateful": false, "batch_input_shape": [null, 8, 2], "name": "lstm_1", "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "units": 100, "recurrent_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}